In [1]:
import mysql.connector

In [2]:
from tabulate import tabulate

In [3]:
conn = mysql.connector.connect(user='root',password='adi@1234',database='assignment')

In [4]:
cursor = conn.cursor()

In [5]:
cursor.execute("create table worker_dup as select * from workers")

Q-1. Write an SQL query to print the FIRST_NAME from Worker table after replacing ‘a’ with ‘A’

In [6]:
cursor.execute("select replace(First_name, 'a', 'A') from worker_dup")
result = cursor.fetchall()

print(tabulate(result,headers=['FirstName'], tablefmt='psql'))

+-------------+
| FirstName   |
|-------------|
| AkAsh       |
| AkA         |
| JAy         |
| AnkitA      |
| PoojA       |
| Anju        |
| KAirA       |
+-------------+

Q-2. Write an SQL query to print all Worker details from the Worker table order by FIRST_NAME Ascending and DEPARTMENT Descending.

In [7]:
cursor.execute("select * from worker_dup order by First_name asc, Department desc")
result = cursor.fetchall()

print(tabulate(result,headers=['Worker_id', 'FirstName', 'SecondName', 'City', 'Email', 'Dept', 'Salary', 'JoiningDate'], tablefmt='psql'))

+-------------+-------------+--------------+----------+--------------------+---------+----------+---------------------+
|   Worker_id | FirstName   | SecondName   | City     | Email              | Dept    |   Salary | JoiningDate         |
|-------------+-------------+--------------+----------+--------------------+---------+----------+---------------------|
|           2 | Aka         | Ma           | Noida    | aka@gmail.com      | Admin   |    30000 | 2021-06-01 09:00:00 |
|           1 | Akash       | Malik        | Delhi    | akash123@gmail.com | HR      |    45000 | 2021-02-20 09:00:00 |
|           6 | Anju        | Tomar        | Noida    | anju@gmail.com     | HR      |    45000 | 2022-04-10 09:00:00 |
|           4 | Ankita      | Jain         | Gurugram | anki@gmail.com     | Account |    40000 | 2022-02-20 09:00:00 |
|           3 | Jay         | Singh        | Delhi    | jay@gmail.com      | Admin   |    45000 | 2022-01-15 09:00:00 |
|           7 | Kaira       | Singh        | Delhi    | kaira@gmail.com    | Account |    30000 | 2022-02-20 09:00:00 |
|           5 | Pooja       | Patil        | Delhi    | pooja@gmail.com    | IT      |    40000 | 2022-02-01 09:00:00 |
+-------------+-------------+--------------+----------+--------------------+---------+----------+---------------------+

Q-3. Write an SQL query to fetch the names of workers who earn the highest salary.

In [8]:
cursor.execute("select First_name, max(Salary) from worker_dup")
result = cursor.fetchall()

print(tabulate(result,headers=['FirstName', 'Salary'], tablefmt='psql'))

+-------------+----------+
| FirstName   |   Salary |
|-------------+----------|
| Akash       |    45000 |
+-------------+----------+

In [9]:
cursor.execute("drop table worker_dup")

In [10]:
cursor.close()
conn.close()